using System;
using System.Collections.Generic;
using System.Linq;
using System.Web;

namespace Fubon_Test.Bussiness
{

    public enum OrderState
    {
                訂單初始 = 0,                      //S0
                訂單成立 = 1,                      //S1
                日終檔正確 = 3,                    //S2
                付款通知正確 = 5,                  //S3   //原始名稱:付款通知正確
                匯款確認待撥 = 7,                  //S4   //原始名稱:匯款確認待撥
                撥款階段 = 8,                      //S5   //原始名稱:撥款檔上傳完成
                //撥款檔上傳完成 = 9,                //S5 //台北富邦 狀態9改為8
                撥款成功 = 10,                      //S6
                訂單失敗 = 51,                     //E0  //2012/7/27 訂單狀態51由訂單失敗改為訂單初始
                對帳狀態異常 = 52,                 //E1x
                日終檔金額不符 = 53,               //E11
                付款狀態異常 = 54,                 //E23
                付款通知金額不符 = 55,             //E21
                撥款失敗 = 56,                     //E51
                取消 = 59,                        //Exx
                應收帳款未收 = 98,                //日終檔正確+付款通知正確 3,5
                應付帳款未付 = 99,                //日終檔正確+付款通知正確+匯款確認待撥+撥款作業 3,5,7,8
    }
}